renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rx.c
/************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018(2019) Renesas Electronics Corporation. All rights reserved.
*************************************************************************************************/
/************************************************************************************************
* System Name  : memdrv software
* File Name    : r_memdrv_rx.c
* Version      : 1.02
* Device       : -
* Abstract     : IO I/F module
* Tool-Chain   : -
* OS           : not use
* H/W Platform : -
* Description  : memdrv I/O file
* Limitation   : None
*************************************************************************************************/
/************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 15.12.2018 1.00     Initial Release
*              : 04.04.2019 1.01     Added support for GNUC and ICCRX.
*                                    Fixed coding style.
*              : 22.11.2019 1.02     Modified comment of API function to Doxygen style.
*************************************************************************************************/

/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_memdrv_rx_if.h"                      /* MEMDRV driver I/F definitions                  */
#include "r_memdrv_rx_config.h"                  /* MEMDRV driver Configuration definitions        */
#include "./src/r_memdrv_rx_private.h"           /* MEMDRV driver Private module definitions       */

/************************************************************************************************
Macro definitions
*************************************************************************************************/

/************************************************************************************************
Typedef definitions
*************************************************************************************************/

/************************************************************************************************
Exported global variables (to be accessed by other files)
*************************************************************************************************/
const uint32_t g_memdrv_dummy_tx = 0xffffffff; /* @suppress("Source line ordering") */
uint32_t g_memdrv_dummy_rx;
#if ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI)) || \
    ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI))
extern rspi_handle_t g_rspi_handle;
extern volatile bool  g_transfer_busy;
#endif
/************************************************************************************************
Private global variables and functions
*************************************************************************************************/
#if  MEMDRV_CFG_LONGQ_ENABLE == 1
static longq_hdl_t       p_memdrv_long_que;     // LONGQ handler    
#endif  /* MEMDRV_CFG_LONGQ_ENABLE */

static uint32_t r_memdrv_get_drv_type(uint8_t devno);
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
static memdrv_err_t memdrv_param_check(uint8_t devno, st_memdrv_info_t * memdrv_info);
#endif
static const st_memdrv_func_t r_memdrv_tbl[MEMDRV_INDX_DRVR_NUM][MEMDRV_INDX_FUNC_NUM] =
{
    /* RX RSPI FIT Module */
    {
        { r_memdrv_rspi_open            },
        { r_memdrv_rspi_close           },
        { r_memdrv_rspi_disable         },
        { r_memdrv_rspi_disable_tx_data },
        { r_memdrv_rspi_disable_rx_data },
        { r_memdrv_rspi_enable          },
        { r_memdrv_rspi_enable_tx_data  },
        { r_memdrv_rspi_enable_rx_data  },
        { r_memdrv_rspi_tx              },
        { r_memdrv_rspi_tx_data         },
        { r_memdrv_rspi_rx              },
        { r_memdrv_rspi_rx_data         },
    },
    /* RX QSPI SMSTR FIT Module */
    {
        { r_memdrv_qspi_open            },
        { r_memdrv_qspi_close           },
        { r_memdrv_qspi_disable         },
        { r_memdrv_qspi_disable_tx_data },
        { r_memdrv_qspi_disable_rx_data },
        { r_memdrv_qspi_enable          },
        { r_memdrv_qspi_enable_tx_data  },
        { r_memdrv_qspi_enable_rx_data  },
        { r_memdrv_qspi_tx              },
        { r_memdrv_qspi_tx_data         },
        { r_memdrv_qspi_rx              },
        { r_memdrv_qspi_rx_data         },
    },
    /* RX SCI SPI FIT Module */
    {
        { r_memdrv_sci_open            },
        { r_memdrv_sci_close           },
        { r_memdrv_sci_disable         },
        { r_memdrv_sci_disable_tx_data },
        { r_memdrv_sci_disable_rx_data },
        { r_memdrv_sci_enable          },
        { r_memdrv_sci_enable_tx_data  },
        { r_memdrv_sci_enable_rx_data  },
        { r_memdrv_sci_tx              },
        { r_memdrv_sci_tx_data         },
        { r_memdrv_sci_rx              },
        { r_memdrv_sci_rx_data         },
    },
};

