renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rx.c
/***********************************************************************************************************************
* Function Name: R_MEMDRV_ClearDMACFlagTx
*******************************************************************************************************************/ /**
* @brief This function clears the transmit empty interrupt flag set at DMAC transfer end.
* @param[in] channel Device channel number
* @details   Clears the transmit empty interrupt flag. Use an interrupt generated at DMAC transfer end.
* @note      None
*/
void R_MEMDRV_ClearDMACFlagTx(uint8_t channel)
{
#if ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI)) || \
    ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI))
    g_rspi_handle->channel = channel;

    R_RSPI_IntSptiIerClear(g_rspi_handle);
#endif
#if ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_QSPI_SMSTR)) || \
    ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_QSPI_SMSTR))
    R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spti_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
#endif
} /* End of function R_MEMDRV_ClearDMACFlagTx() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_ClearDMACFlagRx
*******************************************************************************************************************/ /**
* @brief This function clears the receive buffer full interrupt flag set at DMAC transfer end.
* @param[in] channel Device channel number
* @details   Clears the receive buffer full interrupt flag. Use an interrupt generated at DMAC transfer end.
* @note      None
*/
void R_MEMDRV_ClearDMACFlagRx(uint8_t channel)
{
#if ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI)) || \
    ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_RSPI))
    g_rspi_handle->channel = channel;
    
    R_RSPI_IntSptiIerClear(g_rspi_handle);
    R_RSPI_IntSpriIerClear(g_rspi_handle);
    if (0 == channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH0)
        RSPI0.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
#endif
#endif
    }
    else if (1 == channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH1)
        RSPI1.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
#endif
#endif
    }
    else if (2 == channel)
    {
#if ((MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2) | \
    ((MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH) == MEMDRV_DRVR_CH2)
        RSPI2.SPCR.BIT.SPE   = 0;  // Disable RSPI.
#if RSPI_CFG_REQUIRE_LOCK == 1
        R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_RSPI0 + channel));
#endif
#endif
    }
    else
    {
    }
    g_transfer_busy = false;
#endif
#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR)
    R_QSPI_SMstr_Int_Spti_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spri_Ier_Clear(channel);
    R_QSPI_SMstr_Int_Spri_Dmacdtc_Flag_Set(channel, QSPI_SET_TRANS_STOP);
#endif
} /* End of function R_MEMDRV_ClearDMACFlagRx() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_1msInterval
*******************************************************************************************************************/ /**
* @brief This function performs interval timer count processing.
* @details   Increments the driver software's internal timer counter while waiting for DMAC or DTC transfer end.
* @note      None
*/
void R_MEMDRV_1msInterval(void)
{
#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI)
    r_memdrv_rspi_1ms_interval();
#endif
#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR)
    R_QSPI_SMstr_1ms_Interval();
#endif
#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI)
    r_memdrv_sci_1ms_interval();
#endif
} /* End of function R_MEMDRV_1msInterval() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_SetLogHdlAddress
*******************************************************************************************************************/ /**
* @brief This function processes setting of the LONGQ FIT module handler address.
* @param[in] user_long_que LONGQ FIT module handler address
* @retval    MEMDRV_SUCCESS: Normal end
* @details   Sets the handler address of the LONGQ FIT module in the memory driver.
* @note      If the MEMDRV_CFG_LONGQ_ENABLE == 0 and this function is called, this function does nothing.
*/
memdrv_err_t R_MEMDRV_SetLogHdlAddress(uint32_t user_long_que)
{
#if MEMDRV_CFG_LONGQ_ENABLE == 1
    p_memdrv_long_que = (longq_hdl_t)user_long_que;

#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_RSPI)
    R_RSPI_SetLogHdlAddress(user_long_que);
#endif
#if (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR) | \
    (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_QSPI_SMSTR)
    R_QSPI_SMstr_Set_LogHdlAddress(user_long_que);
#endif
#endif  /* MEMDRV_CFG_LONGQ_ENABLE */

    return MEMDRV_SUCCESS;
}

#if MEMDRV_CFG_LONGQ_ENABLE == 1
/*******************************************************************************
* Function Name: r_memdrv_log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : flg -
*                    Breakpoint processing
*                fid -
*                    MEMDRV driver file No.
*                line -
*                    MEMDRV driver line number
* Return Value : 0 -
*                    Successful operation
*                1 -
*                    Error
*******************************************************************************/
uint32_t r_memdrv_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err;
    uint32_t    ul_tmp;

