renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rx.c
    /* Long to Byte */
    ul_tmp = 0;                                         // log     Reserved
    ul_tmp = (ul_tmp | (line << 8));                    // log     LINE
    ul_tmp = (ul_tmp | (fid  << 21));                   // log     FID FILE No.
    ul_tmp = (ul_tmp | (MEMDRV_DRIVER_ID << 27));       // log     FID DRIVER No.
    ul_tmp = (ul_tmp | (flg  << 31));                   // log     Breakpoint processing

    err = R_LONGQ_Put(p_memdrv_long_que, ul_tmp);
    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }
    return 0;
}
#endif

/***********************************************************************************************************************
* Function Name: R_MEMDRV_GetVersion 
*******************************************************************************************************************/ /**
* @brief This function gets the memory driver version information.
* @return    Upper 2 bytes: Major version (decimal notation).\n
*            Lower 2 bytes: Minor version (decimal notation).
* @details   Returns the driver version information.
* @note      None
*/
uint32_t R_MEMDRV_GetVersion(void)
{
    uint32_t version_number = 0;
    /* Bring in major version number. */
    version_number = ((uint16_t)MEMDRV_VERSION_MAJOR) << 16;
    /* Bring in minor version number. */
    version_number |= (uint16_t)MEMDRV_VERSION_MINOR;
    return version_number;
}/* End of function R_MEMDRV_GetVersion() */

/************************************************************************************************
* Function Name: r_memdrv_get_drv_ch
* Description  : Gets driver channel no.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value : Channel No.
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_memdrv_get_drv_ch(uint8_t devno)
{
    uint8_t channel = 0;

#if (MEMDRV_CFG_DEV0_INCLUDED == 1)
    if (MEMDRV_DEV0 == devno)
    {
        channel = MEMDRV_CFG_DEV0_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH;
    }
#endif /* (MEMDRV_CFG_DEV0_INCLUDED == 1) */

#if (MEMDRV_CFG_DEV1_INCLUDED == 1)
    if (MEMDRV_DEV1 == devno)
    {
        channel = MEMDRV_CFG_DEV1_MODE_DRVR_CH & MEMDRV_DRVR_MASK_CH;
    }
#endif /* (MEMDRV_CFG_DEV1_INCLUDED == 1) */

    return channel;

} /* End of function r_memdrv_get_drv_ch() */

/************************************************************************************************
* Function Name: r_memdrv_get_drv_type
* Description  : Gets driver type.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
* Return Value : driver type.
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static uint32_t r_memdrv_get_drv_type(uint8_t devno)
{
    uint32_t drv_type = 0;

#if (MEMDRV_CFG_DEV0_INCLUDED == 1)
    if (MEMDRV_DEV0 == devno)
    {
        switch (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_MASK_TYPE)
        {
            case MEMDRV_DRVR_RX_FIT_RSPI:
            {
                drv_type = MEMDRV_INDX_RSPI;
            }
            break;
            case MEMDRV_DRVR_RX_FIT_QSPI_SMSTR:
            {
                drv_type = MEMDRV_INDX_QSPI_SMSTR;
            }
            break;
            case MEMDRV_DRVR_RX_FIT_SCI_SPI:
            {
                drv_type = MEMDRV_INDX_SCI_SPI;
            }
            break;
            default:
            {
                /* Do nothing. */
                R_BSP_NOP();
            }
            break;
        }
    }
#endif /* (MEMDRV_CFG_DEV0_INCLUDED == 1) */
#if (MEMDRV_CFG_DEV1_INCLUDED == 1)
    if (MEMDRV_DEV1 == devno)
    {
        switch (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_MASK_TYPE)
        {
            case MEMDRV_DRVR_RX_FIT_RSPI:
            {
                drv_type = MEMDRV_INDX_RSPI;
            }
            break;
            case MEMDRV_DRVR_RX_FIT_QSPI_SMSTR:
            {
                drv_type = MEMDRV_INDX_QSPI_SMSTR;
            }
            break;
            case MEMDRV_DRVR_RX_FIT_SCI_SPI:
            {
                drv_type = MEMDRV_INDX_SCI_SPI;
            }
            default:
            {
                /* Do nothing. */
                R_BSP_NOP();
            }
            break;
        }
    }
#endif /* (MEMDRV_CFG_DEV1_INCLUDED) */

    return drv_type;
} /* End of function r_memdrv_get_drv_type() */

#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
/*******************************************************************************
* Function Name: memdrv_param_check
* Description  : parameter checking.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_PARAM                       ;   parameter error
*******************************************************************************/
static memdrv_err_t memdrv_param_check(uint8_t devno, st_memdrv_info_t * memdrv_info)
{
    if (((devno != MEMDRV_DEV0) && (devno != MEMDRV_DEV1)) || (NULL == memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
    return MEMDRV_SUCCESS;
} /* End of function memdrv_param_check() */
#endif
/***********************************************************************************************************************
* Function Name: R_MEMDRV_Open
*******************************************************************************************************************/ /**
* @brief This function opens the memory driver. This function must be run before calling other API functions.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Initializes the FIT module used for SPI/QSPI/SCI communication and data transfer (only when DTC/DMAC is
*            selected).
* @note      None
*/
memdrv_err_t R_MEMDRV_Open(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_OPEN].p_func(devno, p_memdrv_info);

} /* End of function R_MEMDRV_Open() */

