renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rx.c
/***********************************************************************************************************************
* Function Name: R_MEMDRV_Close
*******************************************************************************************************************/ /**
* @brief This function closes the memory driver.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Closes the FIT module used for SPI/QSPI/SCI communication and data transfer (only when DTC/DMAC is
*            selected).
* @note      None
*/
memdrv_err_t R_MEMDRV_Close(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_CLOSE].p_func(devno, p_memdrv_info);

} /* End of function R_MEMDRV_Close() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_Disable
*******************************************************************************************************************/ /**
* @brief This function disables the memory driver.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @details   Disables the memory driver communication settings.
* @note      None
*/
memdrv_err_t R_MEMDRV_Disable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_DISABLE].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Disable() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_DisableTxData
*******************************************************************************************************************/ /**
* @brief This function disables data transmission by the memory driver.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Disables the DMAC/DTC FIT module settings used for data transmission.
* @note      None
*/
memdrv_err_t R_MEMDRV_DisableTxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_DISABLE_TX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Disable_tx_data() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_DisableRxData
*******************************************************************************************************************/ /**
* @brief This function disables data reception by the memory driver.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Disables the DMAC/DTC FIT module settings used for data reception.
* @note      None
*/
memdrv_err_t R_MEMDRV_DisableRxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_DISABLE_RX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Disable_rx_data() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_Enable
*******************************************************************************************************************/ /**
* @brief This function enables the memory driver.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Processing to enable the memory driver.
* @note      None
*/
memdrv_err_t R_MEMDRV_Enable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_ENABLE].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Enable() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_EnableTxData
*******************************************************************************************************************/ /**
* @brief This function enables data transmission.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Enables the DMAC/DTC FIT module used for data transmission.
* @note      None
*/
memdrv_err_t R_MEMDRV_EnableTxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_ENABLE_TX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Enable_tx_data() */

