renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_rx.c
/***********************************************************************************************************************
* Function Name: R_MEMDRV_EnableRxData
*******************************************************************************************************************/ /**
* @brief This function enables data reception.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Enables the DMAC/DTC FIT module settings used for data reception.
* @note      None
*/
memdrv_err_t R_MEMDRV_EnableRxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_ENABLE_RX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Enable_rx_data() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_Tx
*******************************************************************************************************************/ /**
* @brief This function performs command transmission processing.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_HARD: Hardware error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Transmits the data specified by the memory driver information structure. Supports CPU transfer only.
* @note      None
*/
memdrv_err_t R_MEMDRV_Tx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_TX].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Tx() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_TxData
*******************************************************************************************************************/ /**
* @brief This function performs data transmission processing.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_HARD: Hardware error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Transmits the data specified by the memory driver information structure. Supports CPU, DMAC, and DTC
*            transfer.
* @note      None
*/
memdrv_err_t R_MEMDRV_TxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_TX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Tx_data() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_Rx
*******************************************************************************************************************/ /**
* @brief This function performs processing to receive the state and ID.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_HARD: Hardware error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Receives the data specified by the memory driver information structure. Supports CPU transfer only.
* @note      None
*/
memdrv_err_t R_MEMDRV_Rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_RX].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Rx() */

/***********************************************************************************************************************
* Function Name: R_MEMDRV_RxData
*******************************************************************************************************************/ /**
* @brief This function performs data reception processing.
* @param[in] devno Device number
* @param[in] *p_memdrv_info Memory driver information structure
* @retval    MEMDRV_SUCCESS: Normal end
* @retval    MEMDRV_ERR_PARAM: parameter error
* @retval    MEMDRV_ERR_HARD: Hardware error
* @retval    MEMDRV_ERR_OTHER: Other error
* @details   Receives the data specified by the memory driver information structure. Supports CPU, DMAC, and DTC
*            transfer.
* @note      None
*/
memdrv_err_t R_MEMDRV_RxData(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
#if MEMDRV_CFG_PARAM_CHECKING_ENABLE == 1
    if (MEMDRV_SUCCESS != memdrv_param_check(devno, p_memdrv_info))
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_PARAM;
    }
#endif
    return r_memdrv_tbl[r_memdrv_get_drv_type(devno)]
                       [MEMDRV_INDX_RX_DATA].p_func(devno, p_memdrv_info);
} /* End of function R_MEMDRV_Rx_data() */

/* End Of File */
